[
    {
        "breed": "Shih Tzu",
        "breedListDescription": "This breed is generally sweet and gentle, but may be easily spooked thanks to their small size...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/ShihTzu.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/ShihTzu.png",
        "breedPageLifespan": "10 - 16 years",
        "breedPageShortHistory": "This breed is generally sweet and gentle, but may be easily spooked thanks to their small size. A shih tzu that rarely leaves the house can easily become fearful, reactive, or aggressive around things outside the home – or even with new people inside the home. Proper socialization using positive methods will help prevent these issues.",
        "breedPageFriendlinessNumber": "0.9",
        "breedPageFriendlinessText": "9/10",
        "breedPageActivityNumber": "0.6",
        "breedPageActivityText": "6/10",
        "breedPageSize": "empty",
        "breedPagePersonality": "All dog breeds have a purpose. Historically, the purpose of the Shih Tzu was to be a companion — and that is just what he wants to be. He simply desires to be with you. So do not expect him to hunt, guard, or retrieve; that is not his style. Affection is his dominant characteristic, and your lap is his favorite destination. He is happiest when he is with his family, giving and receiving attention. That said, the Shih Tzu is not a total couch potato. He's alert and lively and may bark at newcomers to his home. Don't worry, though; he'll make friends with your guests the minute they walk inside.",
        "breedPageHealth": "empty",
        "breedPageCare": "The Shih Tzu doesn't really mind where he lives, as long as he's with you. He's a very adaptable dog who can be comfortable in a small city apartment or a large suburban or country home. He is definitely a housedog and should not be kenneled outside, though he enjoys a bit of backyard play. The Shih Tzu is content with short walks each day. He is not an extremely active dog; he's content to sit in your lap, wander around the house, play with his toys, or run to the door to greet visitors. Like other breeds with short faces, the Shih Tzu is sensitive to heat. He should remain indoors in an air-conditioned room (or one with fans) on hot days so he doesn't suffer from heat exhaustion. No, the breed cannot fly; but owners commonly report that their Shih Tzu thinks he can. It not unusual for a Shih Tzu to fearlessly jump from a bed or a chair. While they may not seem high to you, these heights are towering to the small Shih Tzu. And, unfortunately, these jumps often end in injury. The breed is front heavy and crashes forward, causing injury or even a concussion to the head. Be very careful when carrying your Shih Tzu. Hold him securely and don't let him jump out of your arms or off furniture. Even though he's naturally docile and friendly, the Shih Tzu needs early socialization and training. Like any dog, he can become timid if he is not properly socialized when young. Early socialization helps ensure that your Shih Tzu puppy grows up to be a well-rounded dog. Shih Tzus are often considered difficult to housebreak. Most important is to avoid giving your puppy opportunities to have accidents inside — you don't want him to become accustomed to using the carpet. (Some Shih Tzu owners teach their dogs to use a doggie litter box so they don't need to walk them in bad weather or rush home to take them out.) A Shih Tzu puppy should be carefully supervised inside the house until he has not eliminated indoors for at least four to eight weeks. Crate training is helpful for housetraining and provides your dog with a quiet place to relax. A crate is also useful when you board your Shih Tzu or travel.",
        "breedPageFeeding": "Recommended daily amount: 1/2 to 1 cup of high-quality dry food a day. NOTE: How much your adult dog eats depends on his size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference — the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl.",
        "breedPageGrooming": "The long, silky Shih Tzu coat is gorgeous, and it comes in many colors: black, black and white, gray and white, or red and white. A white tip on the tail and a white blaze on the forehead are highly prized. Keeping the Shih Tzu coat gorgeous is demanding. Daily brushing and combing is necessary to prevent tangles, as is frequent bathing (as often as once a week). In fact, many a Shih Tzu lover gives up and hires a professional groomer to clip those long locks short. Gone is some of his beauty, but so is the chore of daily brushing. If you trim the coat short and want to keep it that way, plan on grooming appointments every six to eight weeks. If you do groom him yourself, make the experience as pleasant as possible for both you and your Shih Tzu, starting during puppyhood. (After all, you're going to be doing this a lot.) When brushing, you want to make sure that you brush all the way down to the skin. Most experienced Shih Tzu groomers teach the dog to lie on his side while they brush the coat in sections; it's easier to brush that way and more comfortable for the dog. At about 10 to 12 months of age, the Shih Tzu coat changes from puppy fluff to a silky adult coat. During this stage, you'll probably think the coat mats faster than you can brush. Don't give up! This is temporary, lasting for about three months. Once the adult coat comes in fully, brushing gets easier. The Shih Tzu's nails should be trimmed monthly, and his ears checked once a week for dirt, redness, or a bad odor that can indicate an infection. Wipe them out weekly with a cotton ball dampened with gentle, pH-balanced ear cleaner to prevent problems. Hair grows inside the Shih Tzu's ear canal, and this sometimes needs to be plucked if the dog gets a lot of ear infections. The Shih Tuz's face, like a toddler's, also needs daily attention. He gets dirty after eating, and his eyes tear up readily, so it's necessary to wipe his face regularly with a soft cloth dampened with warm water. Many small breeds are prone to dental problems, and the Shih Tzu is no exception: it's important to take good care of his teeth. Regular tooth brushing with a soft toothbrush and doggie toothpaste will keep his gums and teeth healthy.",
        "breedPageBehaviour": "The Shih Tzu is a wonderful family pet. He gets along with other dogs or animals, and his docile personality makes him a good companion for children. Kids should sit on the floor to play with a Shih Tzu puppy, however, so there is no risk of carrying and dropping him. Children should also learn to keep their fingers away from the Shih Tzu's prominent eyes, which can be easily injured."
    },
    {
        "breed": "Bulldog",
        "breedListDescription": "The Bulldog, also known as the British Bulldog or English Bulldog, is a medium-sized breed of dog. It is a muscular, hefty dog with a wrinkled face and a distinctive pushed-in nose...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/Bulldog.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/Bulldog.png",
        "breedPageLifespan": "8 - 12 years",
        "breedPageShortHistory": "Bulldogs originally were used to drive cattle to market and to compete in a bloody sport called bullbaiting. Today, they’re gentle companions who love kids. A brief walk and a nap on the sofa is just this dog breed‘s speed.",
        "breedPageFriendlinessNumber": "0.8",
        "breedPageFriendlinessText": "8/10",
        "breedPageActivityNumber": "0.6",
        "breedPageActivityText": "6/10",
        "breedPageSize": "Mature male Bulldogs weigh about 50 pounds; mature females about 40 pounds. Show dogs may be about 10 pounds heavier. They stand 12 to 15 inches at the shoulder.",
        "breedPagePersonality": "Sociable and sweet, but with a reputation for courage that makes him an excellent watchdog, the Bulldog is a lover, not a fighter. He's dignified rather than lively and has a kind although occasionally stubborn nature. The Bulldog is friendly and easygoing; he gets along with everyone. He can be a slow learner, but once he knows something, he's got it for good. Bulldogs don't tend to be barkers. Usually their appearance alone is enough to frighten off intruders. Temperament is affected by a number of factors, including heredity, training, and socialization. Puppies with nice temperaments are curious and playful, willing to approach people and be held by them. Choose the middle-of-the-road puppy, not the one who's beating up his littermates or the one who's hiding in the corner. Always meet at least one of the parents-usually the mother is the one who's available-to ensure that they have nice temperaments that you're comfortable with. Meeting siblings or other relatives of the parents is also helpful for evaluating what a puppy will be like when he grows up. Like every dog, Bulldogs need early socialization-exposure to many different people, sights, sounds, and experiences-when they're young. Socialization helps ensure that your Bulldog puppy grows up to be a well-rounded dog. Enrolling him in a puppy kindergarten class is a great start. Inviting visitors over regularly, and taking him to busy parks, stores that allow dogs, and on leisurely strolls to meet neighbors will also help him polish his social skills.",
        "breedPageHealth": "Like all breeds, Bulldogs are prone to certain diseases and conditions. Not all Bulldogs will get any or all of these diseases, but it's important to be aware of them so you can be informed when you interview breeders and can know what to look for throughout your Bulldog's life. Buying from a responsible breeder will help ensure that you get the healthiest Bulldog possible. A puppy from a reputable Bulldog breeder will be vaccinated and dewormed before you take him home. Responsible breeders use only physically sound, mature (at least 2 years or older) dogs, and test their breeding stock for genetic diseases pertinent to the breed. Both parents should have health clearances, documentation that a dog has been tested for and cleared of a particular condition. In Bulldogs, you should expect to see health clearances from the Orthopedic Foundation for Animals for hips, elbow, and knees, and from the Canine Eye Registry Foundation (CERF), certifying that the eyes are normal. Health clearances are not issued to dogs younger than 2 years of age. That's because some health problems don't appear until a dog reaches full maturity. For this reason, it's often recommended that dogs not be bred until they are two or three years old. Overall, Bulldogs can have a lot of health problems. They are wonderful dogs, but be sure you're willing to monitor their health closely and can afford any medical treatment they may need.",
        "breedPageCare": "The Shih Tzu doesn't really mind where he lives, as long as he's with you. He's a very adaptable dog who can be comfortable in a small city apartment or a large suburban or country home. He is definitely a housedog and should not be kenneled outside, though he enjoys a bit of backyard play. The Shih Tzu is content with short walks each day. He is not an extremely active dog; he's content to sit in your lap, wander around the house, play with his toys, or run to the door to greet visitors. Like other breeds with short faces, the Shih Tzu is sensitive to heat. He should remain indoors in an air-conditioned room (or one with fans) on hot days so he doesn't suffer from heat exhaustion. No, the breed cannot fly; but owners commonly report that their Shih Tzu thinks he can. It not unusual for a Shih Tzu to fearlessly jump from a bed or a chair. While they may not seem high to you, these heights are towering to the small Shih Tzu. And, unfortunately, these jumps often end in injury. The breed is front heavy and crashes forward, causing injury or even a concussion to the head. Be very careful when carrying your Shih Tzu. Hold him securely and don't let him jump out of your arms or off furniture. Even though he's naturally docile and friendly, the Shih Tzu needs early socialization and training. Like any dog, he can become timid if he is not properly socialized when young. Early socialization helps ensure that your Shih Tzu puppy grows up to be a well-rounded dog. Shih Tzus are often considered difficult to housebreak. Most important is to avoid giving your puppy opportunities to have accidents inside — you don't want him to become accustomed to using the carpet. (Some Shih Tzu owners teach their dogs to use a doggie litter box so they don't need to walk them in bad weather or rush home to take them out.) A Shih Tzu puppy should be carefully supervised inside the house until he has not eliminated indoors for at least four to eight weeks. Crate training is helpful for housetraining and provides your dog with a quiet place to relax. A crate is also useful when you board your Shih Tzu or travel.",
        "breedPageFeeding": "Recommended daily amount: 1/2 to 2 cups of a high-quality dog food daily, divided into two meals. How much your adult dog eats depends on his size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference — the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl. It's easy to overfeed a Bulldog, but obesity can stress his joints, so he shouldn't be allowed to get fat. Keep your adult Bulldog in good shape by measuring his food and feeding him twice a day rather than leaving food out all the time. If you're unsure whether he's overweight, give him the hands-on test. Place your hands on his back, thumbs along the spine, with the fingers spread downward. You should be able to feel but not see his ribs without having to press hard. If you can't, he needs less food and more exercise.",
        "breedPageGrooming": "Your Bulldog's coat should be straight, short, fine textured, smooth and glossy. He has soft, loose skin, especially on the head, neck, and shoulders. His head is covered with heavy wrinkles and he has two loose folds at the throat (from the jaw to the chest) to form what's called a dewlap. Bulldogs come in a variety of colors: red brindle; all other brindles; solid white; solid red, fawn, or fallow (pale cream to light fawn, pale yellow, or yellow red; and piebald (large patches of two or more colors). Solid black isn't common and isn't much admired. Brush the Bulldog's smooth, fine, short-haired coat once a week with a firm bristle brush. Wipe his face with a damp cloth every day, taking care to clean inside the wrinkles. Be sure to dry the inside of the wrinkles completely after they're washed. Some people suggest wiping the wrinkles with baby wipes that have lanolin and aloe vera. If your Bulldog's skin is irritated inside of the wrinkles, ask your vet to recommend a soothing ointment. After you've cleaned the wrinkles, wash your Bulldog's nose and apply petroleum jelly to it to keep it soft and prevent it from becoming dry and flaky. The Bulldog is an average shedder. If you can take the time to brush him more than once a week, it will help reduce the amount of hair that gets on your clothes and furniture. Other grooming needs include nail care and dental hygiene. Trim your Bulldog's nails once or twice a month. If you can hear them clicking on the floor, they're too long. The earlier you introduce your Bulldog to nail trimming the less stressful the experience is for both of you.Brush the teeth at least two or three times a week — daily is better — to remove tartar and bacteria. Start when your puppy is young so he'll be used to it. As you groom, check for sores, rashes, or signs of infection such as redness, tenderness, or inflammation on the skin, in the ears, nose, mouth, and eyes, and on the feet. Ears should smell good, without too much wax or gunk inside, and eyes should be clear, with no redness or discharge. Your careful weekly exam will help you spot potential health problems early.",
        "breedPageBehaviour": "His amiable temperament and bulk make the Bulldog an excellent companion for children, even young ones. A Bulldog will put up with a lot from a child, although he shouldn't have to, and he'll walk away if he gets tired of being tormented. Always teach children how to approach and touch dogs, and always supervise any interactions between dogs and young children to prevent any biting or ear or tail pulling on the part of either party. Teach your child never to approach any dog while he's sleeping or eating or to try to take the dog's food away. No dog should ever be left unsupervised with a child. With their pacific nature, Bulldogs also get along well with other pets, dogs and cats. They may be less sociable toward strange dogs, however."
    },
    {
        "breed": "Akita",
        "breedListDescription": "The Akita is a large and powerful dog with a noble and intimidating presence. He was originally used for guarding royalty and nobility in feudal Japan.",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/Akita.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/Akita.png",
        "breedPageLifespan": "10 - 12 years",
        "breedPageShortHistory": "The Akita is a large and powerful dog breed with a noble and intimidating presence. They were originally used for guarding royalty and nobility in feudal Japan. These dogs also tracked and hunted wild boar, black bear, and sometimes deer. The Akita does not back down from challenges and does not frighten easily. Consequently, they are fearless and loyal guardians of their families. Yet they are also affectionate, respectful, and amusing dogs when properly trained and socialized. An Akita is bound to shed quite a bit, and you may be wiping some drool from their face if you bring one home. Certainly, owners should be prepared for some cleanup. Furthermore, they tend to be stubborn and are not overly fond of strangers. While those can be good traits for a watchdog, they will need an experienced trainer if they are to interact with other animals or people. Novices beware. That said, dogs of this breed are faithful companions that will be attached to the right owner for life and shower them with adoration and love. Therefore, if you and your family are up for the challenge and consider adopting an Akita, you’ll have a lifelong friend that won’t let you down.",
        "breedPageFriendlinessNumber": "0.4",
        "breedPageFriendlinessText": "4/10",
        "breedPageActivityNumber": "0.8",
        "breedPageActivityText": "8/10",
        "breedPageSize": "Males stand 26 to 28 inches and weigh 85 to 130 pounds. Females stand 24 to 26 inches and weigh 70 to 110 pounds.",
        "breedPagePersonality": "The Akita is a bold and willful dog, naturally wary of strangers but extremely loyal to their family. They are alert, intelligent, and courageous. They tend to be aggressive toward other dogs, especially those of the same sex. They are best suited to a one-dog household. With family, the Akita is affectionate and playful. They enjoy the companionship of their family and want to participate in daily activities. They're mouthy and enjoy carrying toys and household items around. Despite the common belief that they never bark, they are in fact noisy, known to grumble, moan—and, yes, bark if they believe the situation warrants it. Be aware, the Akita's strong personality can be overwhelming. They are not the dog for a first-time owner, and they are not for the timid. They need an owner who can provide firm, loving discipline. Activity is essential for this active breed. They need plenty of exercise to keep them from becoming bored and, in turn, destructive. The naturally protective Akita has a propensity to become aggressive if allowed, or if they aren't raised properly. Training the Akita is essential, and so is proper socialization from an early age. Keep in mind that this breed is stubborn, so extra patience is necessary to teach them proper canine manners.",
        "breedPageHealth": "Akitas are generally healthy, but like all breeds of dogs, they're prone to certain conditions and diseases.",
        "breedPageCare": "The Akita is happiest and does best when living inside with their family. This breed is not hyper, but they do need daily exercise. Thirty minutes to an hour a day is sufficient for an Akita; brisk walks, jogging (for an adult dog over two years of age), and romping in the yard are favorite activities. Visits to a dog park are probably not a good idea, given the Akita's aggressive tendency toward other dogs. Due to this breed's high intelligence, a varied routine is best. What you don't want is a bored Akita. That leads to such behavior problems as barking, digging, chewing, and aggression. Include the Akita with family activities, and don't leave them alone for long periods at a time. A securely fenced yard is important, too, both for the safety of the Akita and for the safety of strangers who may mistakenly come into their turf. While they aren't typically aggressive with visitors if their family is home, all bets are off if their owners aren't around. The Akita is a loyal guardian, and they'll protect against anything they perceive to be a threat. Special care must be taken when raising an Akita puppy. These dogs grow very rapidly between the age of four and seven months, making them susceptible to bone disorders. They do well on a high-quality, low-calorie diet that keeps them from growing too fast. In addition, don't let your Akita puppy run and play on hard surfaces, such as pavement; normal play on grass is fine. Avoid forced jumping or jogging on hard surfaces until the dog is at least two years old and their joints are fully formed (puppy agility classes, with their one-inch jumps, are fine).",
        "breedPageFeeding": "Recommended daily amount: 3 to 5 cups of high-quality dry food a day. NOTE: How much your adult dog eats depends on their size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference—the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl. Talk to your veterinarian about formulating an appropriate diet for your individual dog.",
        "breedPageGrooming": "There are many different colors and color combinations in the American Akita, including black, white, chocolate, a combination of color and white, or brindle. The Akita is double-coated, with the undercoat being very dense and plush; the topcoat is short. Overall, grooming the Akita isn't terribly difficult. But the Akita is a shedder, so frequent vacuuming will be your new lifestyle if you choose this breed. Akita fur will be found on furniture, clothing, dishes, in food, and will form myriad dust bunnies on floors and carpets. Heavier shedding occurs two or three times a year. Weekly brushing helps reduce the amount of hair in your home, and it keeps the plush coat of the Akita healthy. Despite their self-grooming habits, the Akita also needs bathing every three months or so. Of course, more often is okay if your dog rolls in a mud puddle or something smelly. The nails need to be trimmed once a month, and the ears checked once a week for dirt, redness, or a bad odor that can indicate an infection. Also wipe the ears out weekly, using a cotton ball dampened with gentle, pH-balanced ear cleaner, to prevent problems. As with all breeds, it is important to begin grooming the Akita at an early age. Making grooming a positive and soothing experience will ensure easier handling as your Akita puppy grows into a large, willful adult.",
        "breedPageBehaviour": "Adults should always supervise interactions between dogs and kids, and this is especially true with this breed. No child could have a more loyal guardian and playmate than an Akita, but a mistreated Akita can become a liability and may even endanger your child's life. It is imperative to teach youngsters to be respectful and kind in all their interactions with dogs. Play between dogs and kids should always be supervised, even with well-trained dogs. That said, the Akita is suitable for families with older children. They should usually live in a one-pet household, however, because they can aggressive toward other dogs and will chase other pets if not trained properly."
    },
    {
        "breed": "Appenzeller Sennenhunde",
        "breedListDescription": "The Appenzeller originated as an all-around farm dog breed, who stayed busy herding the livestock, guarding the farm, and pulling carts in his native Switzerland...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/AppenzellerSennenhunde.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/AppenzellerSennenhunde.png",
        "breedPageLifespan": "9 - 12 years",
        "breedPageShortHistory": "The Appenzeller originated as an all-around farm dog breed, who stayed busy herding the livestock, guarding the farm, and pulling carts in his native Switzerland. Today’s Appenzellers have still got the energy, smarts, and self-confidence that makes for valuable working dogs — but they’re anything but low-maintenance. Dogs of this breed need lots of exercise, training, and a job to do.",
        "breedPageFriendlinessNumber": "0.8",
        "breedPageFriendlinessText": "8/10",
        "breedPageActivityNumber": "0.8",
        "breedPageActivityText": "8/10",
        "breedPageSize": "Males stand 20 to 22 inches at the shoulder; females,19.5 to 21 inches. Weight ranges from about 48 to 55 pounds.",
        "breedPagePersonality": "empty",
        "breedPageHealth": "empty",
        "breedPageCare": "empty",
        "breedPageFeeding": "empty",
        "breedPageGrooming": "Appenzellers have a thick, shiny topcoat in black or brown with tan and white markings, covering a thick black, brown, or gray undercoat. The tan markings are symmetrical and appear over the eyes and on the cheeks, chest, and legs. The white markings include a blaze on the face, white from the chin to the chest, white on all four feet, and a white tail tip. They have an easy-care coat that needs only regular brushing to stay in good shape, but Appenzellers do shed.",
        "breedPageBehaviour": "empty"
    },
    {
        "breed": "Australian Terrier",
        "breedListDescription": "The Australian Terrier was developed in Australia, as his name implies. Bred to hunt and exterminate rodents and snakes, Australian Terriers were also prized as watchdogs and companions...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/AustralianTerrier.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/AustralianTerrier.png",
        "breedPageLifespan": "up to 15 years",
        "breedPageShortHistory": "The Australian Terrier was developed in Australia, as his name implies. Bred to hunt and exterminate rodents and snakes, Australian Terriers were also prized as watchdogs and companions. Today, the Australian Terrier dog breed maintains those same characteristics: he is a delightful companion, a fierce earthdog competitor, and a conformation and obedience showman.",
        "breedPageFriendlinessNumber": "0.6",
        "breedPageFriendlinessText": "6/10",
        "breedPageActivityNumber": "1.0",
        "breedPageActivityText": "10/10",
        "breedPageSize": "Both males and females stand 10 to 11 inches tall and weigh 14 to 16 pounds.",
        "breedPagePersonality": "The Aussie is a fun-loving, upbeat dog who makes a great companion for any individual or family who wants to share his energetic lifestyle. Devoted to his owners, he's happiest when he's part of daily family life. He likes to be in the house, playing with the kids, following you room to room, or shouldering his way to the front door when you greet a friend. He is clever and should be easy to train — as long as you keep him busy and never, ever bore him.",
        "breedPageHealth": "Australian Terriers are generally healthy but, like all breeds of dogs, they're prone to certain conditions and diseases.",
        "breedPageCare": "The Aussie enjoys the company of his human companions and does best when living in the house, not left to his own devices in the yard — which he will dig up like a gopher if given the chance. Your flowerbeds might stand a chance if you can train him to dig only in one designated spot in the yard, but don't bet on it. Chances are he'll make up his own mind about the best digging areas. You'll be better off if you supervise him closely when he's in the yard. Don't leave him alone too long or he'll be overcome by temptation, and your tidy landscaping will be only a memory. You must also fence your backyard to live amicably with your Aussie, who will take off after any cat, rat, or rabbit he sees if he's not confined or supervised on a leash. Since all dogs in the Terrier group tend to be bossy and aggressive around other dogs, proper socialization of your Aussie puppy is a must. Regular obedience training, beginning with puppy classes, is not only fun but is essential with this breed. Keep in mind, though, that the Aussie is a quick study — don't bore him by practicing the same lessons over and over. In fact, you may find that your intelligent Aussie is the type who loves progressively challenging levels of obedience classes and agility training. Motivation is key: the task at hand must be challenging and fun, and you must offer an irresistible incentive, such as treats, toys, or verbal praise. You don't work for free, and neither does the Aussie. Begin crate training when he's a puppy. This will help you housetrain him, and it provides him with a welcome refuge as well as a familiar means of safe travel when he's in the car. The spirited Aussie needs plenty of exercise — ideally, several brisk walks a day. He remains active well into his golden years.",
        "breedPageFeeding": "Recommended daily amount: 1/2 to 1 cup dry food a day. Unlike some small breeds, the Aussie is not a fussy eater. He has a hearty appetite, though he doesn't usually overeat. For more on feeding your Australian Terrier, see our guidelines for buying the right food, feeding your puppy, and feeding your adult dog. NOTE: How much your adult dog eats depends on his size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference — the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl.",
        "breedPageGrooming": "The Aussie's shaggy coat is rough to the touch, with a soft undercoat. About two inches in length over most of the body, it is longer on the chest and head. It comes in three color types: blue and tan (tan body with a blue saddle), sandy, and red. The Aussie sheds minimally, and it's easy to groom him. Brush him once a week, trim his toenails once a month, and bathe him as needed — usually every three months or so, unless he has rolled in a scent that only a dog could love. Frequent bathing isn't recommended because it softens the coarse terrier coat. While a soft coat isn't harmful to any dog and is fine for a pet, it does detract from a show Aussie's physical appearance. Check the ears once a week for dirt, redness, or a bad odor that can indicate an infection. Also wipe them out weekly with a cotton ball dampened with gentle, pH-balanced ear cleaner to prevent problems.",
        "breedPageBehaviour": "The Aussie makes a wonderful family pet, well suited to families with kids. He loves to play but, like all dogs, should be properly socialized and supervised around very young children. He prefers to be with his people and can become destructive when left alone too long. He also has a penchant for chasing cats and small animals, so he isn't best suited to homes with rabbits, mice, or hamsters. However, with patient training, the Aussie can be taught to respect and leave alone the animals he lives with — but only those he lives with. He will eagerly chase the neighbor's cat or a squirrel at a park."
    },
    {
        "breed": "Labrador Retriever",
        "breedListDescription": "The Labrador Retriever was bred to be both a friendly companion and a useful working dog breed. Historically, he earned his keep as a fisherman’s helper...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/LabradorRetriever.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/LabradorRetriever.png",
        "breedPageLifespan": "10 - 12 years",
        "breedPageShortHistory": "The Labrador Retriever was bred to be both a friendly companion and a useful working dog breed. Historically, he earned his keep as a fisherman’s helper: hauling nets, fetching ropes, and retrieving fish from the chilly North Atlantic. Today’s Labrador Retriever is as good-natured and hard working as his ancestors, and he’s America’s most popular breed. These days the Lab works as a retriever for hunters, assistance dog to the handicapped, show competitor, and search and rescue dog, among other canine jobs.",
        "breedPageFriendlinessNumber": "1.0",
        "breedPageFriendlinessText": "10/10",
        "breedPageActivityNumber": "1.0",
        "breedPageActivityText": "10/10",
        "breedPageSize": "Males stand 22.5 to 24.5 inches, and weigh 65 to 80 pounds. Females stand 21.5 to 23.5 inches, and weigh 55 to 70 pounds.",
        "breedPagePersonality": "The Lab has the reputation of being one of the most sweet-natured breeds, and it's well deserved. He's outgoing, eager to please, and friendly with both people and other animals. Aside from a winning personality, he has the intelligence and eagerness to please that make him easy to train. Training is definitely necessary because this breed has a lot of energy and exuberance. The working heritage of the Lab means he is active. This breed needs activity, both physical and mental, to keep him happy. There is some variation in the activity level of Labs: some are rowdy, others are more laid back. All thrive on activity.",
        "breedPageHealth": "Labrador Retrievers are generally healthy, but like all breeds, they're prone to certain health conditions. Not all Labs will get any or all of these diseases, but it's important to be aware of them if you're considering this breed.",
        "breedPageCare": "The lovable Lab needs to be around his family, and is definitely not a backyard dog. If he's left alone for too long, he'll probably tarnish his saintly reputation: A lonely, bored Lab is apt to dig, chew, or find other destructive outlets for his energy. Labs show some variation in their activity levels, but all of them need activity, both physical and mental. Daily 30-minute walks, a romp at the dog park, or a game of fetch, are a few ways to help your Lab burn off energy. However, a puppy should not be taken for too long walks and should play for a few minutes at a time. Labrador Retrievers are considered 'workaholics', and will exhaust themselves. It is up to you to end play and training sessions. Labs have such good reputations that some owners think they don't need training. That's a big mistake. Without training, a rambunctious Lab puppy will soon grow to be a very large, rowdy dog. Luckily, Labs take to training well — in fact, they often excel in obedience competitions. Start with puppy kindergarten, which not only teaches your pup good canine manners, but helps him learn how to be comfortable around other dogs and people. Look for a class that uses positive training methods that reward the dog for getting it right, rather than punishing him for getting it wrong. You'll need to take special care if you're raising a Lab puppy. Don't let your Lab puppy run and play on very hard surfaces such as pavement until he's at least two years old and his joints are fully formed. Normal play on grass is fine, as is puppy agility, with its one-inch jumps. Like all retrievers, the Lab is mouthy, and he's happiest when he has something, anything, to carry in his mouth. He's also a chewer, so be sure to keep sturdy toys available all the time — unless you want your couch chewed up. And when you leave the house, it's wise to keep your Lab in a crate or kennel so he's can't get himself into trouble chewing things he shouldn't.",
        "breedPageFeeding": "Recommended daily amount: 2.5 to 3 cups of high-quality dry food a day, divided into two meals. Note: How much your adult dog eats depends on his size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference — the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl. Keep your Lab in good shape by measuring his food and feeding him twice a day rather than leaving food out all the time. If you're unsure whether he's overweight, give him the eye test and the hands-on test. First, look down at him. You should be able to see a waist. Then place your hands on his back, thumbs along the spine, with the fingers spread downward. You should be able to feel but not see his ribs without having to press hard. If you can't, he needs less food and more exercise. You'll need to take special care if you're raising a Lab puppy. These dogs grow very rapidly between the age of four and seven months, making them susceptible to bone disorders. Feed your puppy a high-quality, low-calorie diet that keeps them from growing too fast.",
        "breedPageGrooming": "The sleek and easy-care Lab coat has two layers: a short, thick, straight topcoat, and a soft, weather-resistant undercoat. The two-layer coat protects him from the cold and wet, which helps him in his role as a retriever for hunters. The coat comes in three colors: chocolate, black, and yellow. Black was the favorite color among early breeders, but over the years, yellow and chocolate Labs have become popular. Some breeders have recently begun selling 'rare' colored Labrador Retrievers, such as polar white or fox red. These shades aren't really rare — they're a variation of the yellow Lab. Grooming doesn't get much easier than with a Lab, but the breed does shed — a lot. Buy a quality vacuum cleaner and brush your dog daily, especially when he's shedding, to get out the loose hair. Labs need a bath about every two months or so to keep them looking clean and smelling good. Of course, if your Lab rolls in a mud puddle or something foul, which he's apt to do, it's fine to bathe him more often. Brush your Lab's teeth at least two or three times a week to remove tartar buildup and the bacteria that lurk inside it. Daily brushing is even better if you want to prevent gum disease and bad breath. Trim nails once or twice a month if your dog doesn't wear them down naturally. If you can hear them clicking on the floor, they're too long. Short, neatly trimmed nails keep the feet in good condition and prevent your legs from getting scratched when your Lab enthusiastically jumps up to greet you. His ears should be checked weekly for redness or a bad odor, which can indicate an infection. When you check your dog's ears, wipe them out with a cotton ball dampened with gentle, pH-balanced ear cleaner to help prevent infections. Don't insert anything into the ear canal; just clean the outer ear. Because ear infections are common in Labs, also clean out the ears after bathing, swimming, or any time your dog gets wet. This helps prevent infection. Begin accustoming your Lab to being brushed and examined when he's a puppy. Handle his paws frequently — dogs are touchy about their feet — and look inside his mouth. Make grooming a positive experience filled with praise and rewards, and you'll lay the groundwork for easy veterinary exams and other handling when he's an adult. As you groom, check for sores, rashes, or signs of infection such as redness, tenderness, or inflammation on the skin, in the nose, mouth, and eyes, and on the feet. Eyes should be clear, with no redness or discharge. Your careful weekly exam will help you spot potential health problems early.",
        "breedPageBehaviour": "The Labrador Retriever not only loves kids, he enjoys the commotion they bring with them. He'll happily attend a child's birthday party, and even willingly wear a party hat. Like all dogs, however, he needs to be trained how to act around kids — and kids need to be taught how to act around the dog. As with every breed, you should always teach children how to approach and touch dogs, and always supervise any interactions between dogs and young children to prevent any biting or ear or tail pulling on the part of either party. Teach your child never to approach any dog while he's eating or sleeping or to try to take the dog's food away. No dog, no matter how friendly, should ever be left unsupervised with a child. If a Lab has had plenty of exposure to other dogs, cats, and small animals, and has been trained how to interact with them, he'll be friendly with other pets, too."
    },
    {
        "breed": "Miniature Pinscher",
        "breedListDescription": "The Labrador Retriever was bred to be both a friendly companion and a useful working dog breed. Historically, he earned his keep as a fisherman’s helper...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/MiniaturePinscher.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/MiniaturePinscher.png",
        "breedPageLifespan": "10 - 14 years",
        "breedPageShortHistory": "The Miniature Pinscher dog breed was originally bred in Germany to hunt vermin, primarily rats, in homes and stables. Many people think that the Miniature Pinscher was developed by breeding Dobermans to progressively smaller sizes, and indeed, the Miniature Pinscher looks similar to a Doberman. However, the Min Pin is a distinct and much older breed. Known as the “King of Toys” for his stately appearance and self-assured attitude, the Miniature Pinscher is a fearless, energetic, and alert companion dog who enjoys the company of his family.",
        "breedPageFriendlinessNumber": "0.6",
        "breedPageFriendlinessText": "6/10",
        "breedPageActivityNumber": "0.8",
        "breedPageActivityText": "8/10",
        "breedPageSize": "Males and females stand 10 to 12.5 inches high and weigh 8 to 11 pounds.",
        "breedPagePersonality": "There's good reason the Min Pin is called the King of Toys. He has a spirited, confident personality that both delights and exasperates his owners. He's fearless, intensely curious, and always ready for action. He's got nonstop energy and is intelligent and vigorous. He's an excellent watchdog. The Min Pin might as well be a detective. He wants to investigate everything and, if he isn't watched closely, he'll get himself into trouble. Living with a Min Pin is similar to living with a toddler who needs constant supervision. When you aren't supervising, he should be securely tucked away in a crate. Obviously, crate training is highly recommended. Don't forget the Min Pin's penchant for escaping. He'll find weak places in the fencing or dash out the front door while you sign for a package. You have to be on your guard to keep this breed safe. The Min Pin doesn't lounge about — he's too busy for that — but he is affectionate and loving with his family. He loves to entertain, and he'll often play the class clown in order to get the attention he craves. Temperament is affected by a number of factors, including heredity, training, and socialization. Puppies with nice temperaments are curious and playful, willing to approach people and be held by them. Choose the middle-of-the-road puppy, not the one who's beating up his littermates or the one who's hiding in the corner. Always meet at least one of the parents — usually the mother is the one who's available — to ensure that they have nice temperaments that you're comfortable with. Meeting siblings or other relatives of the parents is also helpful for evaluating what a puppy will be like when he grows up. Like every dog, the Min Pin needs early socialization — exposure to many different people, sights, sounds, and experiences — when they're young. Socialization helps ensure that your Min Pin puppy grows up to be a well-rounded dog. Enrolling him in a puppy kindergarten class is a great start. Inviting visitors over regularly, and taking him to busy parks, stores that allow dogs, and on leisurely strolls to meet neighbors will also help him polish his social skills.",
        "breedPageHealth": "Min Pins are generally healthy, but like all breeds, they're prone to certain health conditions. Not all Min Pins will get any or all of these diseases, but it's important to be aware of them if you're considering this breed. If you're buying a puppy, find a good breeder who will show you health clearances for both your puppy's parents. Health clearances prove that a dog has been tested for and cleared of a particular condition. In Min Pins, you should expect to see health clearances from the Orthopedic Foundation for Animals (OFA) for hip dysplasia (with a score of fair or better), elbow dysplasia, hypothyroidism, and von Willebrand's disease; from Auburn University for thrombopathia; and from the Canine Eye Registry Foundation (CERF) certifying that eyes are normal. You can confirm health clearances by checking the OFA web site (offa.org).",
        "breedPageCare": "It is absolutely essential to set up safeguards to protect the curious Min Pin. You'll need to 'baby-proof' the house just as you would for a crawling baby or a toddler. Make sure all small objects (keys, coins, kids' toys, and so forth) stay out of his reach. Medication can be a serious issue, because the Min Pin will find and ingest any pills that you chance to drop on the floor; be sure to put those away after every use. Go over your yard and fencing with a fine-toothed comb. Look for and fix any hole or opening, because if your hand can fit through it, somehow your Min Pin can too. Make sure all doors and windows, and their screens, are sturdy and secure as well. The Min Pin needs early socialization and training. Like any dog, he can become timid or quarrelsome if he is not properly socialized when young. Early socialization helps ensure that your Min Pin puppy grows up to be a well-rounded dog. Because he really thinks he's a king, you must be a strong pack leader with the Min Pin. He's not a good breed for first-time dog owners; even if you're an experienced dog owner but you're new to the breed, it's helpful to work with a trainer who has experience teaching these vivacious dogs. The Min Pin can quickly get the upper hand. While you certainly don't want to rule with an iron fist, you must establish firm leadership. The Min Pin doesn't have a lot of fur, which means he's sensitive to cold. Buy him a doggie sweater he can wear during cold winter months.",
        "breedPageFeeding": "Recommended daily amount: 1/2 to 1 cup of high-quality dry food a day, divided into two meals. Note: How much your adult dog eats depends on his size, age, build, metabolism, and activity level. Dogs are individuals, just like people, and they don't all need the same amount of food. It almost goes without saying that a highly active dog will need more than a couch potato dog. The quality of dog food you buy also makes a difference — the better the dog food, the further it will go toward nourishing your dog and the less of it you'll need to shake into your dog's bowl. Keep your Min Pin in good shape by measuring his food and feeding him twice a day rather than leaving food out all the time. If you're unsure whether he's overweight, give him the eye test and the hands-on test. First, look down at him. You should be able to see a waist. Then place your hands on his back, thumbs along the spine, with the fingers spread downward. You should be able to feel but not see his ribs without having to press hard. If you can't, he needs less food and more exercise.",
        "breedPageGrooming": "The Min Pin is extremely handsome in his short, sleek coat. Colors include red, black and rust, and chocolate and rust. Grooming doesn't get much easier than this. The Min Pin needs brushing every few days to keep his sleek coat shiny; a soft bristle brush or grooming mitt works well. Frequent bathing is not recommended because it dries the skin, though it's okay to bath the Min Pin when he rolls in something smelly or is very dirty. Instead of bathing, many owners simply wet a washcloth with warm water and wipe the Min Pin's coat. Begin with the face, paying particular attention to the area under the eyes, and work back toward the tail. If you do this every few days, the Min Pin will stay clean and healthy. Brush your Min Pin's teeth at least two or three times a week to remove tartar buildup and the bacteria that lurk inside it. Daily brushing is even better if you want to prevent gum disease and bad breath. Trim his nails once or twice a month if your dog doesn't wear them down naturally to prevent painful tears and other problems. If you can hear them clicking on the floor, they're too long. Dog toenails have blood vessels in them, and if you cut too far you can cause bleeding — and your dog may not cooperate the next time he sees the nail clippers come out. So, if you're not experienced trimming dog nails, ask a vet or groomer for pointers.His ears should be checked weekly for redness or a bad odor, which can indicate an infection. When you check your dog's ears, wipe them out with a cotton ball dampened with gentle, pH-balanced ear cleaner to help prevent infections. Don't insert anything into the ear canal; just clean the outer ear. Begin accustoming your Min Pin to being brushed and examined when he's a puppy. Handle his paws frequently — dogs are touchy about their feet — and look inside his mouth. Make grooming a positive experience filled with praise and rewards, and you'll lay the groundwork for easy veterinary exams and other handling when he's an adult.As you groom, check for sores, rashes, or signs of infection such as redness, tenderness, or inflammation on the skin, in the nose, mouth, and eyes, and on the feet. Eyes should be clear, with no redness or discharge. Your careful weekly exam will help you spot potential health problems early.",
        "breedPageBehaviour": "If a Miniature Pinscher is raised with children who treat him carefully and kindly, he will adore them and be a trustworthy companion. However, if children are allowed to grab or treat him roughly, even accidentally, he may develop a bad attitude toward kids, or at least want to avoid them as much as possible. The Min Pin is best suited for children age 10 and older. As with every breed, you should always teach children how to approach and touch dogs, and always supervise any interactions between dogs and young children to prevent any biting or ear or tail pulling on the part of either party. Teach your child never to approach any dog while he's eating or sleeping or to try to take the dog's food away. No dog, no matter how friendly, should ever be left unsupervised with a child. Many owners have more than one Min Pin; properly socialized and trained, these dogs get along with other dogs just fine (expect some bossiness as they work out who's top dog). As far as other pets are concerned, the Min Pin's instinct is to chase, so he isn't well suited to homes with small mammals."
    },
    {
        "breed": "Beagle",
        "breedListDescription": "Small, compact, and hardy, Beagles are active companions for kids and adults alike. Canines in this dog breed are merry and fun loving...",
        "breedListImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20List%20Images/Beagle.png",
        "breedPageImage": "https://raw.githubusercontent.com/kamillobinski/data/master/Dog-App-Data/Breed%20Image%20Preview/Beagle.png",
        "breedPageLifespan": "10 - 15 years",
        "breedPageShortHistory": "Small, compact, and hardy, Beagles are active companions for kids and adults alike. Canines in this dog breed are merry and fun loving, but being hounds, they can also be stubborn and require patient, creative training techniques. Their noses guide them through life, and they’re never happier than when following an interesting scent. The Beagle originally was bred as a scenthound to track small game, mostly rabbits and hare. He is still used for this purpose in many countries, including the United States.",
        "breedPageFriendlinessNumber": "1.0",
        "breedPageFriendlinessText": "10/10",
        "breedPageActivityNumber": "1.0",
        "breedPageActivityText": "10/10",
        "breedPageSize": "The American Kennel Club recognizes two varieties of Beagle. The 13-inch variety is for hounds that don't exceed 13 inches in height at the shoulder, and the 15-inch variety is for hounds that stand 13 inches to 15 inches at the shoulder. Depending on their height, Beagles weigh between 18 and 30 pounds.",
        "breedPagePersonality": "Beagles are gentle, sweet, and funny. They will make you laugh, but that's when they're not making you cry because of their often naughty behavior. Beagle people spend a lot of time trying to outthink their dogs, and they often must resort to food rewards to lure the Beagle into a state of temporary obedience. Like every dog, the Beagle needs early socialization — exposure to many different people, sights, sounds, and experiences — when they're young. Socialization helps ensure that your Beagle puppy grows up to be a well-rounded dog.",
        "breedPageHealth": "empty",
        "breedPageCare": "empty",
        "breedPageFeeding": "empty",
        "breedPageGrooming": "empty",
        "breedPageBehaviour": "empty"
    }
]
